




-git clone "ссылка на репозиторий(без ковычек)"
-cd overone "переход в репозиторий"("Оверван возможно название")
- git status "Проверить статус, есть ли что комментировать  что изменилось на сервере"

-git add ."чтобы добавить все файлы в папке в гит"
-git add "название файла".py("без ковычек")
-git comit -m "коммент" "добавление комментария"
-git log "посмотреть комментарии"
- git push origin main "отправить фалый на сервер. main название ветки в которой работаем""важно если есть изменения на сервере оно не отправит, надо сразу забрать"
-git pull origin mail "забрать изменения с сервера"
после скачивания надо убрать вручную лишние строки

-git gui& "вызвать графическйи интерфейс через который можно коментить и пушить файл"

- git checkout -b имя ветки "создать другую ветку в которой можно делать изменения"  "-b чтобы сразу переключится в новую ветку"
- ls "посмотреть файлы и папки в фиче"
-git origin имя ветки "залить изменения в ветку"


первоое git add
дальше git comit
далее git push orig...